In [1]:
import pandas as pd

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+

Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+


Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| null                |
+---------------------+

In [2]:
df1 = pd.DataFrame({'id': [1,2,3], 'salary':[100,200,300]})
df2 = pd.DataFrame({'id': [1], 'salary':[100]})
df3 = pd.DataFrame([1,1,1,1], columns = ['salary'])
df4 = pd.DataFrame({'id':[1,2,3], 'salary':[10,10,50]})
df5 = pd.DataFrame({'id':[1,2,3], 'salary':[100,100,50]})

In [3]:
df1

   id  salary
0   1     100
1   2     200
2   3     300

In [4]:
df2

   id  salary
0   1     100

In [5]:
df3

   salary
0       1
1       1
2       1
3       1

In [6]:
df4

   id  salary
0   1      10
1   2      10
2   3      50

In [7]:
df5

   id  salary
0   1     100
1   2     100
2   3      50

In [8]:
df1['salary'].sort_values(ascending = False)[1]

200

In [9]:
type(df1['salary'].sort_values(ascending = False)[1])

numpy.int64

In [10]:
pd.DataFrame([df1['salary'].sort_values(ascending = False)[1]], columns=['SecondHighestSalary'])

   SecondHighestSalary
0                  200

In [11]:
pd.DataFrame([pd.NA], columns=['SecondHighestSalary'])

  SecondHighestSalary
0                <NA>

In [12]:
len(df1.salary.unique())

3

In [13]:
import pandas as pd

def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    if((employee.shape[0] == 1) | (len(employee.salary.unique()) == 1)):
        return(pd.DataFrame([pd.NA], columns = ['SecondHighestSalary']))
    else:
        return(pd.DataFrame([sorted(list(set(employee.salary.to_list())), reverse = True)[1]], columns=['SecondHighestSalary']))

In [14]:
second_highest_salary(df1)

   SecondHighestSalary
0                  200

In [15]:
second_highest_salary(df2)

  SecondHighestSalary
0                <NA>

In [16]:
second_highest_salary(df3)

  SecondHighestSalary
0                <NA>

In [17]:
second_highest_salary(df4)

   SecondHighestSalary
0                   50

In [18]:
second_highest_salary(df5)

   SecondHighestSalary
0                  100

In [19]:
second_highest_salary(employee=pd.DataFrame(data = {'id':[1,2],'salary':[100,200]}))

   SecondHighestSalary
0                  200

In [20]:
df4 = pd.DataFrame(data = {'id':[1,2],'salary':[100,200]})
df4

   id  salary
0   1     100
1   2     200

In [21]:
sorted(list(set(df4.salary.to_list())))[1]

200

In [22]:
df4.salary.sort_values(ascending=False)

1    200
0    100
Name: salary, dtype: int64

In [23]:
df4.salary.sort_values(ascending=False).to_list()[1]

100